<?php 
            ////הסבר
          //הפוקנציה בודקת את חוקיות התאריך.
          //לאחר מכן בודקת את ההפרש בין התאריך המובקש לבין 01/01/2019
          //הפונקציה מחלקת את הפרש הימים בין התאריכים ב-7 על מנת למצוא את מספר הימים שיש לדלג מיום שני של התאריך 01/01/2019,
          //נערכת בדיקה האם יש שארית בתוצאת החישוב. אם לא, בהכרח היום המובקש הוא יום שני
          // במידה ויש שארית, הפונקציה מוצאת את המספר השלם ללא השארית, מחשבת את הפרש הימים פחות תוצאת החישוב, וכך מוצאת מספר הימים שיש לדלג מיום שני
          // במידה ומספר הימים שיש לדלג הוא 6, בהכרח שהיום המובקש הוא יום ראשון, ומכיון שאין במערך מקום [6+1] בידלתי אותו משאר החישוב
          // במקרה אחר, מוחזר הערך מהמערך מהמקום של יום שני [1] ועוד תוצאת החישוב
          // קיבלנו את היום המובקש...

          function dayInMonth($d, $m, $y){
            if(!checkdate($m,$d,$y)){
              return 'תאריך לא חוקי.';
            }
            $days = array('Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','Sabbath');            
            $dateFrom = date_create("1900-01-01");
            $dateUntil = date_create("$y-$m-$d");
            $diff = date_diff($dateFrom,$dateUntil);
            $Calc = $diff->days/7;
            $pos = strpos($Calc, '.');
            if($pos){
              $Calc = substr($Calc, 0, $pos);
              $Calc = $diff->days-($Calc*7);
            }
            else{
              $Calc = 0;
            }  
            return $Calc == 6?$days[0]:$days[1+$Calc];
           }